#include <iostream>
#include <math.h>
using namespace std;
int main()
{
	setlocale(LC_ALL, "Rus");
	int a1, a2, b1, b2, c1, c2; // создаЄм переменные дл€ заданных чисел
	float x, y; // переменные дл€ двух неизвестных
	cout << "a1 = "; // ввод чисел
	cin >> a1;
	cout << "a2 = ";
	cin >> a2;
	cout << "b1 = ";
	cin >> b1;
	cout << "b2 = ";
	cin >> b2;
	cout << "c1 = ";
	cin >> c1;
	cout << "c2 = ";
	cin >> c2;
	cout << a1 << " * x " << "+ " << b1 << " * y = " << c1 << endl; // выводим на экран первую строчку уравнени€ 
	cout << a2 << " * x " << "+ " << b2 << " * y = " << c2 << endl; // выводим на экран вторую строчку уравнени€ 
	y = (c2 * a1 - a2 * c1) / (b2 * a1 - a2 * b1); // упростив уравнение, находим чему равен Y
	x = (c1 - b1 * y) / a1; // подставиви Y, находим X
	if (a1 == 0) //  случаи когда система не имеет решени€
	{
		cout << "Ќет решений" << endl;
	}
	if (b2 * a1 - a2 * b1 == 0)
	{
		cout << "Ќет решений" << endl;
	}
	if ((b2 * a1 - a2 * b1 != 0) and (a1 != 0)) 
	{
		cout << "x = " << x << endl << "y = " << y << endl; // выводим на экран найденные X и Y 
	}

}